In [1]:
import pandas as pd
import numpy as np
from constants import *
from utils import scopeStrLength

In [2]:
pd.set_option('display.max_columns', None)
#pd.set_option("display.max_rows", None)

In [3]:
match = pd.read_csv(PATH_TAB_MATCH)
tourn = pd.read_csv(PATH_TAB_TOURNAMENT)
date = pd.read_csv(PATH_TAB_DATE)
player = pd.read_csv(PATH_TAB_PLAYER)
geo = pd.read_csv(PATH_TAB_GEO)

# DATA CLEANING
- Stats
- Handle Missing Values (replace)

In [4]:
print("**********\n** TABs **\n**********")
print(f"Match: {match.shape}")
print(f"Tournament: {tourn.shape}")
print(f"Date: {date.shape}")
print(f"Player: {player.shape}")
print(f"Geography: {geo.shape}")

**********
** TABs **
**********
Match: (161817, 30)
Tournament: (4910, 8)
Date: (375, 5)
Player: (10074, 7)
Geography: (154, 3)

### Date Tab
La table non presenta ne valori anomali ne missin values. La chiave primaria contiene tutte le date dal 2016 al 2021. Gli altri attributi sono stati derivati dalla chiave e quindi sono regolari.

In [5]:
date.shape

(375, 5)

In [6]:
date.head()

    date_id  day  month  year  quarter
0  20181231   31     12  2018        4
1  20190107    7      1  2019        1
2  20190114   14      1  2019        1
3  20190204    4      2  2019        1
4  20190211   11      2  2019        1

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date_id  375 non-null    int64
 1   day      375 non-null    int64
 2   month    375 non-null    int64
 3   year     375 non-null    int64
 4   quarter  375 non-null    int64
dtypes: int64(5)
memory usage: 14.8 KB

In [8]:
date.describe()

            date_id         day       month         year     quarter
count  3.750000e+02  375.000000  375.000000   375.000000  375.000000
mean   2.018335e+07   14.869333    5.896000  2018.274667    2.328000
std    1.618478e+04    8.524045    3.465238     1.622625    1.128929
min    2.016010e+07    1.000000    1.000000  2016.000000    1.000000
25%    2.017052e+07    7.000000    3.000000  2017.000000    1.000000
50%    2.018081e+07   15.000000    6.000000  2018.000000    2.000000
75%    2.019121e+07   22.000000    9.000000  2019.000000    3.000000
max    2.021082e+07   31.000000   12.000000  2021.000000    4.000000

In [9]:
date.isna().sum()

date_id    0
day        0
month      0
year       0
quarter    0
dtype: int64

### Tournament Tab
La table contiene alcuni missing values nell'attributo 'surface', sostituiti con il valore più frequente. Inoltre, abbiamo controllato che gli attributi non numerici non contenesseto stringhe non regolari (ie. stringhe composte da un char soltanto o blank values)

In [10]:
tourn.shape

(4910, 8)

In [11]:
tourn.head()

,tourney_id,date_id,tourney_name,surface,draw_size,tourney_level,tourney_spectators,tourney_revenue
0,2019-M020-A,20181231,Brisbane,Hard,32,A,3928,742618.69
1,2019-M020-P,20181231,Brisbane,Hard,32,P,3928,742618.69
2,2019-0451-A,20181231,Doha,Hard,32,A,2923,550943.19
3,2019-0891-A,20181231,Pune,Hard,32,A,4062,1005592.39
4,2019-0301-A,20190107,Auckland,Hard,32,A,2784,489426.09

In [12]:
tourn.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4910 entries, 0 to 4909
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   tourney_id          4910 non-null   object
 1   date_id             4910 non-null   int64
 2   tourney_name        4910 non-null   object
 3   surface             4910 non-null   object
 4   draw_size           4910 non-null   int64
 5   tourney_level       4910 non-null   object
 6   tourney_spectators  4910 non-null   int64
 7   tourney_revenue     4910 non-null   float64
dtypes: float64(1), int64(3), object(4)
memory usage: 307.0+ KB

In [13]:
tourn.describe()

            date_id    draw_size  tourney_spectators  tourney_revenue
count  4.910000e+03  4910.000000         4910.000000     4.910000e+03
mean   2.018031e+07    29.380041         2952.248880     5.889517e+05
std    1.531931e+04    17.100537         1860.942892     3.887455e+05
min    2.016010e+07     2.000000           91.000000     1.786574e+04
25%    2.017021e+07    32.000000         2331.250000     4.342581e+05
50%    2.018042e+07    32.000000         3073.000000     5.965443e+05
75%    2.019072e+07    32.000000         3638.750000     7.384102e+05
max    2.021082e+07   128.000000        18086.000000     5.002794e+06

In [14]:
tourn.isna().sum()

tourney_id            0
date_id               0
tourney_name          0
surface               0
draw_size             0
tourney_level         0
tourney_spectators    0
tourney_revenue       0
dtype: int64

In [15]:
tourn['surface'].value_counts()

Hard      2660
Clay      2052
Grass      110
Carpet      88
Name: surface, dtype: int64

In [16]:
tourn.fillna(value={'surface':tourn['surface'].mode()[0]}, inplace=True)

In [17]:
# Controllo se tra gli attributi non numerici ci sono delle stringhe non regolari:
# ie. nulle ma non nan, blank spaces o singoli caratteri

#scopeStrLength(tourn['tourney_id'],9)
#scopeStrLength(tourn['tourney_name'],4)
#tourn['surface'].value_counts()
#tourn['tourney_level'].value_counts()

### Player
La tabella contiene diversi attributi con valori mancanti. Gli attributi a valori discreti sono stati sostituiti con la moda, mentre i valori numerici (year of birth) considerando la mediana. Lo scoping delle stringhe non ha rilevato stringhe anomale troppo corte.

In [18]:
player.shape

(10074, 7)

In [19]:
player.head()

   player_id country_id                name sex hand   ht  year_of_birth
0     105453        JPN       Kei Nishikori   M    R  178           1992
1     106421        RUS     Daniil Medvedev   M    R  198           1998
2     104542        FRA  Jo-Wilfried Tsonga   F    R  188           1987
3     104871        FRA       Jeremy Chardy   M    R  188           1989
4     200282        AUS      Alex De Minaur   M    R  183           2001

In [20]:
player.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10074 entries, 0 to 10073
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   player_id      10074 non-null  int64
 1   country_id     10074 non-null  object
 2   name           10074 non-null  object
 3   sex            10074 non-null  object
 4   hand           10074 non-null  object
 5   ht             10074 non-null  int64
 6   year_of_birth  10074 non-null  int64
dtypes: int64(3), object(4)
memory usage: 551.0+ KB

In [21]:
player.describe()

           player_id            ht  year_of_birth
count   10074.000000  10074.000000   10074.000000
mean   196397.719575    184.827080    1999.838396
std     41580.118805      2.165788       4.511971
min    100644.000000    145.000000    1947.000000
25%    201898.250000    185.000000    1998.000000
50%    214867.500000    185.000000    2001.000000
75%    221452.750000    185.000000    2003.000000
max    245099.000000    211.000000    2007.000000

In [22]:
player.fillna(value={'sex':player['sex'].mode()[0]}, inplace=True)
player.fillna(value={'hand':player['hand'].mode()[0]}, inplace=True)
player.fillna(value={'ht':player['ht'].mode()[0]}, inplace=True)
player.fillna(value={'year_of_birth':player['year_of_birth'].median()}, inplace=True)

In [23]:
# Controllo se tra gli attributi non numerici se ci sono delle stringhe non regolari:
# ie. nulle ma non nan, blank spaces o singoli caratteri
#scopeStrLength(player['country_id'],3)
#scopeStrLength(player['name'],5)
#player['sex'].value_counts()
#player['hand'].value_counts()
#player['ht'].value_counts()  ---> abbiamo un valore di ht uguale a 2 -> lo eliminiamo

htFMedian = int(player[player['sex']=='F'][['ht']].median())
player.loc[player.name == 'Kamilla Rakhimova', 'ht'] = htFMedian

### Match Tab
La table contiene molti attributi numerici con valori mancanti, opportunamente sostituiti considerando la mediana. Inoltre, abbiamo selettivamente sostituito alcuni valori anomali:
- alcune partite hanno una durata nulla (0 minutes) nonostante lo score indichi una partita completa (non annullata e nessun ritirato - RET)
- ht di 2cm (errori di battitura)

In [24]:
match.shape

(161817, 30)

In [25]:
match.head()

,tourney_id,match_id,winner_id,loser_id,score,best_of,round,minutes,w_ace,w_df,w_svpt,w_1stIn,w_1stWon,w_2ndWon,w_SvGms,w_bpSaved,w_bpFaced,l_ace,l_df,l_svpt,l_1stIn,l_1stWon,l_2ndWon,l_SvGms,l_bpSaved,l_bpFaced,winner_rank,winner_rank_points,loser_rank,loser_rank_points
0,2019-M020-A,300-2019-M020-A,105453,106421,6-4 3-6 6-2,3,F,124,3,3,77,44,31,17,13,3,6,8,6,100,54,34,20,14,10,15,9,3590,16,1977
1,2019-M020-A,299-2019-M020-A,106421,104542,7-6(6) 6-2,3,SF,82,10,1,52,33,28,14,10,0,1,17,2,77,52,36,7,10,10,13,16,1977,239,200
2,2019-M020-A,298-2019-M020-A,105453,104871,6-2 6-2,3,SF,66,2,2,47,33,26,9,8,2,2,10,3,46,27,15,6,8,1,5,9,3590,40,1050
3,2019-M020-A,297-2019-M020-A,104542,200282,6-4 7-6(2),3,QF,106,12,2,68,43,34,15,11,4,5,1,2,81,60,38,9,11,4,6,239,200,31,1298
4,2019-M020-A,296-2019-M020-A,106421,105683,6-7(2) 6-3 6-4,3,QF,129,12,3,105,68,48,25,16,8,8,29,5,94,56,46,19,15,2,4,16,1977,18,1855

In [26]:
match.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161817 entries, 0 to 161816
Data columns (total 30 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   tourney_id          161817 non-null  object
 1   match_id            161817 non-null  object
 2   winner_id           161817 non-null  int64
 3   loser_id            161817 non-null  int64
 4   score               161817 non-null  object
 5   best_of             161817 non-null  int64
 6   round               161817 non-null  object
 7   minutes             161817 non-null  int64
 8   w_ace               161817 non-null  int64
 9   w_df                161817 non-null  int64
 10  w_svpt              161817 non-null  int64
 11  w_1stIn             161817 non-null  int64
 12  w_1stWon            161817 non-null  int64
 13  w_2ndWon            161817 non-null  int64
 14  w_SvGms             161817 non-null  int64
 15  w_bpSaved           161817 non-null  int64
 16  w_bpFaced           161817 non-null  int64
 17  l_ace               161817 non-null  int64
 18  l_df                161817 non-null  int64
 19  l_svpt              161817 non-null  int64
 20  l_1stIn             161817 non-null  int64
 21  l_1stWon            161817 non-null  int64
 22  l_2ndWon            161817 non-null  int64
 23  l_SvGms             161817 non-null  int64
 24  l_bpSaved           161817 non-null  int64
 25  l_bpFaced           161817 non-null  int64
 26  winner_rank         161817 non-null  int64
 27  winner_rank_points  161817 non-null  int64
 28  loser_rank          161817 non-null  int64
 29  loser_rank_points   161817 non-null  int64
dtypes: int64(26), object(4)
memory usage: 37.0+ MB

In [27]:
match.describe()

,winner_id,loser_id,best_of,minutes,w_ace,w_df,w_svpt,w_1stIn,w_1stWon,w_2ndWon,w_SvGms,w_bpSaved,w_bpFaced,l_ace,l_df,l_svpt,l_1stIn,l_1stWon,l_2ndWon,l_SvGms,l_bpSaved,l_bpFaced,winner_rank,winner_rank_points,loser_rank,loser_rank_points
count,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000,161817.000000
mean,176180.824963,177877.241056,3.026462,93.369448,4.383940,2.396269,68.817250,42.398394,30.921047,14.192656,10.537613,3.240716,5.165205,2.729892,3.278061,70.948955,43.059320,26.891260,12.317519,10.458728,4.296224,8.374689,366.795466,439.095725,413.543293,319.972401
std,47318.475445,47492.694368,0.228526,28.752226,3.003731,1.714819,17.477927,11.643169,7.793488,4.044479,2.335307,2.151168,2.894098,2.728868,1.815578,17.077674,11.464941,8.387957,4.322846,2.313238,2.183499,2.752985,293.355661,971.016462,326.192197,642.418828
min,100644.000000,100644.000000,3.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000,1.000000,1.000000
25%,111442.000000,111761.000000,3.000000,90.000000,4.000000,2.000000,67.000000,41.000000,30.000000,14.000000,10.000000,3.000000,5.000000,2.000000,3.000000,69.000000,42.000000,26.000000,12.000000,10.000000,4.000000,8.000000,147.000000,59.000000,186.000000,50.000000
50%,202659.000000,203501.000000,3.000000,90.000000,4.000000,2.000000,67.000000,41.000000,30.000000,14.000000,10.000000,3.000000,5.000000,2.000000,3.000000,69.000000,42.000000,26.000000,12.000000,10.000000,4.000000,8.000000,290.000000,167.000000,323.000000,139.000000
75%,213550.000000,214229.000000,3.000000,90.000000,4.000000,2.000000,67.000000,41.000000,30.000000,14.000000,10.000000,3.000000,5.000000,2.000000,3.000000,69.000000,42.000000,26.000000,12.000000,10.000000,4.000000,8.000000,514.000000,403.000000,557.000000,307.000000
max,245099.000000,245099.000000,5.000000,4756.000000,72.000000,114.000000,1957.000000,1330.000000,836.000000,304.000000,49.000000,209.000000,266.000000,67.000000,114.000000,1672.000000,893.000000,532.000000,399.000000,50.000000,120.000000,190.000000,2220.000000,16790.000000,2257.000000,16790.000000

In [28]:
match.isna().sum()

tourney_id            0
match_id              0
winner_id             0
loser_id              0
score                 0
best_of               0
round                 0
minutes               0
w_ace                 0
w_df                  0
w_svpt                0
w_1stIn               0
w_1stWon              0
w_2ndWon              0
w_SvGms               0
w_bpSaved             0
w_bpFaced             0
l_ace                 0
l_df                  0
l_svpt                0
l_1stIn               0
l_1stWon              0
l_2ndWon              0
l_SvGms               0
l_bpSaved             0
l_bpFaced             0
winner_rank           0
winner_rank_points    0
loser_rank            0
loser_rank_points     0
dtype: int64

In [29]:
match.columns

Index(['tourney_id', 'match_id', 'winner_id', 'loser_id', 'score', 'best_of',
       'round', 'minutes', 'w_ace', 'w_df', 'w_svpt', 'w_1stIn', 'w_1stWon',
       'w_2ndWon', 'w_SvGms', 'w_bpSaved', 'w_bpFaced', 'l_ace', 'l_df',
       'l_svpt', 'l_1stIn', 'l_1stWon', 'l_2ndWon', 'l_SvGms', 'l_bpSaved',
       'l_bpFaced', 'winner_rank', 'winner_rank_points', 'loser_rank',
       'loser_rank_points'],
      dtype='object')

In [30]:
match.fillna(value={'score':match['score'].mode()[0]}, inplace=True)
colsToFill = match.columns[7:]
for col in colsToFill:
    match.fillna(value={col:match[col].median()}, inplace=True)
    
#ci sono alcuni match che durano 0 minuti ma sono completi (no W/O e no RET). Impossibile

In [31]:
# Controllo se tra gli attributi non numerici se ci sono delle stringhe non regolari:
# ie. nulle ma non nan, blank spaces o singoli caratteri
#scopeStrLength(match['match_id'],13)
#scopeStrLength(match['tourney_id'],10)
#scopeStrLength(match['score'],7)
#match['round'].value_counts()

### Geography Tab
Abbiamo importato due ulteriori csv files per derivare i continenti e le lingue che hanno avevano un valore. Ulteriori valori rimanenti sono stati corretti selettivamente.

In [32]:
geo.shape

(154, 3)

In [33]:
geo.head()

  country_ioc continent  language
0         JPN      Asia  Japanese
1         RUS    Europe   Russian
2         FRA    Europe    French
3         AUS   Oceania   English
4         CAN   America   English

In [34]:
geo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 154 entries, 0 to 153
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   country_ioc  154 non-null    object
 1   continent    154 non-null    object
 2   language     154 non-null    object
dtypes: object(3)
memory usage: 3.7+ KB

#### sostituzione dei continenti mancanti
https://pkgstore.datahub.io/JohnSnowLabs/country-and-continent-codes-list/country-and-continent-codes-list-csv_csv/data/b7876b7f496677669644f3d1069d3121/country-and-continent-codes-list-csv_csv.csv

In [35]:
# Cancello il continente 'unknown' e lo rendo nullo
geo['continent'].replace('Unknown',np.NaN,inplace=True)

In [36]:
cont = pd.read_csv(PATH_CONTINENT)
cont = cont[["Three_Letter_Country_Code","Continent_Name"]]
cont['Continent_Name'] = cont['Continent_Name'].replace({'North America': 'America','South America':'America'}, regex=True)
cont.drop_duplicates(subset=['Three_Letter_Country_Code'], keep='last',inplace=True)

In [37]:
geo=geo.merge(cont,how='left',left_on='country_ioc',right_on='Three_Letter_Country_Code')

In [38]:
geo['continent'].fillna(geo['Continent_Name'],inplace=True)
geo['continent'].fillna('Africa',inplace=True)
del geo['Continent_Name']
del geo["Three_Letter_Country_Code"]

In [39]:
geo['continent'].value_counts()

Europe     52
Africa     34
Asia       33
America    30
Oceania     5
Name: continent, dtype: int64

#### sostituzione delle lingue mancanti
https://github.com/vijinho/ISO-Country-Data/blob/master/languages.csv

In [40]:
lang = pd.read_csv(PATH_LANG_2)
lang = lang[["alpha3","name"]]
lang['alpha3']=lang['alpha3'].str.upper()
lang = lang[~lang['alpha3'].isna()]
lang.drop_duplicates(subset=['alpha3'], keep='last', inplace=True)

In [41]:
geo=geo.merge(lang,how='left',left_on='country_ioc',right_on='alpha3')

In [42]:
# Sostituisco le lingue mancanti prendendole dal csv importato
geo['language'].fillna(geo['name'],inplace=True)
del geo['alpha3']
del geo['name']

In [43]:
# Le lingue residue le correggo manualmente
geo.loc[geo.country_ioc == 'RUS', 'language'] = 'Russian'
geo.loc[geo.country_ioc == 'FRA', 'language'] = 'French'
geo.loc[geo.country_ioc == 'URU', 'language'] = 'Spanish'
geo.loc[geo.country_ioc == 'CUB', 'language'] = 'Spanish'
geo.loc[geo.country_ioc == 'CAN', 'language'] = 'English'
geo.loc[geo.country_ioc == 'USA', 'language'] = 'English'
geo.loc[geo.country_ioc == 'GBR', 'language'] = 'English'
geo.loc[(geo.continent == 'Africa') & (geo.language == ' '), 'language'] = 'Arabic'
geo.loc[(geo.continent == 'Africa') & (geo.language.isnull()),'language'] = 'Arabic'
geo.loc[(geo.language.isnull()) | (geo.language == ' '), 'language'] = 'English'

In [44]:
# Rieseguo il casting perchè abbiamo notato che la pd.read_csv cambia i tipi (da int a float) precedentemente settati
match = match.astype(MATCH_FEAT_TYPE)
tourn = tourn.astype(TOURN_FEAT_TYPE)
date = date.astype(DATE_FEAT_TYPE)
player = player.astype(PLAYER_FEAT_TYPE)
geo = geo.astype(GEO_FEAT_TYPE)

In [45]:
tourn.to_csv("./tourn.csv", index=False)
date.to_csv("./date.csv", index=False)

In [46]:
t = pd.read_csv("./tourn.csv")
d = pd.read_csv("./date.csv")

In [49]:
d['date_id'].isna().sum()

0

In [291]:
a = set(t['date_id'])
b = set(d['date_id'])

In [292]:
a==b

True

In [294]:
player.to_csv("./player.csv", index=False)
geo.to_csv("./geo.csv", index=False)

In [295]:
p = pd.read_csv("./player.csv")
g = pd.read_csv("./geo.csv")

In [296]:
a = set(p['country_id'])
b = set(g['country_ioc'])

In [297]:
a==b

True